Repository: 84000/data-translation-memory
Catalog: toh216-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ན་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་བྱ་བ་བྱེད་པར་མངོན་དུ་ཞུགས་སོ།
en: Each of those blessed buddhas then engaged in the performance of buddha activity for beings in the buddha realms in the ten directions.

source: །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འཇམ་དཔལ་དུས་ལ་བབ་བོ།
en: King Ajātaśatru then sent his messengers to invite Mañjuśrī Kumārabhūta to the midday meal with the message, “Mañjuśrī, the time has come.

source: །འཇམ་དཔལ་མན་ལ་བབ་བོ།
en: Mañjuśrī, the occasion is here.

source: །བཤོས་ལགས་ཀྱིས་དེའི་དུས་ལ་བབ་པར་མཁྱེན་པར་མཛོད་ཅིག་ཅེས་ཕོ་ཉ་གདུགས་ཚོད་ལ་སྤྱན་འདྲེན་དུ་བཅུག་གོ།
en: The meal is ready, so please be aware that the time has come.”

source: །དེ་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་ཤམ་ཐབས་བགོས། ཆོས་གོས་དང་ལྷུང་བཟེད་ཁྱེར་ཏེ།
en: That morning the elder Mahākāśyapa donned his lower garment and took up his Dharma robes and alms bowl.

source: དགེ་སློང་ལྔ་བརྒྱ་དང་འགྲོགས་ནས་བསོད་སྙོམས་ཀྱི་ཕྱིར་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་སོང་བ་ལས།
en: He went to the city of Rājagṛha accompanied by five hundred monks to collect alms.

source: དེ་ལམ་གྱི་ཚིགས་སུ་ཕྱིན་པ་དང་འདི་སྙམ་དུ་གྱུར་ཏེ། གྲོང་ཁྱེར་ཆེན་པོར་འགྲོ་བ་ཧ་ཅང་སྔ་ཆེས་ཀྱིས།
en: Arriving at a juncture in the road, he thought, “It is too early to go to the city.

source: གང་བདག་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་གཙུག་ལག་ཁང་ག་ལ་བ་དེར་སོང་དང་། དེ་ན་གཏམ་གྱི་རྒྱུན་ཅིག་ཡོད་པར་འགྱུར་རོ་སྙམ་མོ།
en: I will instead go to Mañjuśrī Kumārabhūta’s monastery, where we can have a discussion.”

source: །དེ་ནས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་དགེ་སློང་ལྔ་བརྒྱ་ཙམ་པོ་དེ་དག་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་གཙུག་ལག་ཁང་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་། དགའ་བ་དང་། མགུ་བའི་གཏམ་རྣམ་པ་སྣ་ཚོགས་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: The elder Mahākāśyapa and the five hundred monks then went to Mañjuśrī Kumārabhūta’s monastery and had many pleasing and enjoyable conversations with Mañjuśrī before they sat down to one side.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ཕྱོགས་གཅིག་ཏུ་འདུག་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ཅིའི་ཕྱིར་ན་ནང་པར་སྔར་ཤམ་ཐབས་བགོས། ཆོས་གོས་དང་ལྷུང་བཟེད་ཁྱེར་ཏེ་འགྲོ། སྨྲས་པ།
en: Mañjuśrī Kumārabhūta then asked the elder Mahākāśyapa seated there, “Venerable Mahākāśyapa, why did you earlier don your lower garment and go out with your Dharma robes and alms bowl?” “

source: འཇམ་དཔལ་བདག་ནི་བསོད་སྙོམས་ཀྱི་སླད་དུ་རྒྱལ་པོའི་ཁབ་ཏུ་མཆི་བར་འཚལ་ལོ།
en: Mañjuśrī, I decided to go to Rājagṛha to collect alms.”

source: །འཇམ་དཔལ་གྱིས་སྨྲས་པ། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་འཁོར་དང་བཅས་པ་ལ་བདག་གིས་བཤོས་གསོལ་གྱིས་དགོངས་ཤིག །སྨྲས་པ།
en: Mañjuśrī replied, “Venerable Mahākāśyapa, I intend to offer you and your retinue food.” “

source: འཇམ་དཔལ་བགྱིས་ཤིང་མཆོད་པར་འཚལ་ཏེ། བདག་ནི་ཆོས་འཚལ་གྱི། ཟང་ཟིང་འཚལ་བ་མ་ལགས་སོ། །སྨྲས་པ།
en: Mañjuśrī, while I do seek offerings, I seek the Dharma, not material things.” “

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་བདག་ལ་དགོངས་ཤིག་དང་ཟང་ཟིང་གིས་བསྡུ་བ་དང་།
en: Venerable Mahākāśyapa, heed me.

source: ཆོས་ཀྱིས་བསྡུ་བ་གཉི་ག་ཁྱོད་ལ་འདུ་བར་མཆིའོ།
en: I will collect for you both a collection of material things and a collection of the Dharma.”

source: །འོད་སྲུང་ཆེན་པོས་སྨྲས་པ། འཇམ་དཔལ་བདག་ནི་འཚལ་མ་ཆད་ཀྱང་ཁྱོད་ཀྱི་སླད་བཞིན་དུ་འབྲང་འཚལ་ལོ།
en: Mahākāśyapa replied, “Mañjuśrī, even if I had to give up food for the day, I would still follow you.

source: ཆོས་སྟོན་པ་དེ་ནི་ཇི་ལྟར་ཁྱོད་ཀྱི་དྲུང་ནས་ཐོས་པ་འདྲ་བར་གཞན་ལས་མི་ཐོས་སོ།
en: I will not hear the Dharma that you teach from anyone but you.

source: །འཇམ་དཔལ་དེ་རིང་སེམས་ཅན་ཆེན་པོ་དེ་དག་དང་གང་དུ་བཤོས་གསོལ། འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Mañjuśrī, where will you have your meal today with these great beings?”

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་གང་གི་ཚེ་བདག་ཅག་ལ་སྦྱིན་པ་སྦྱིན་ནས་འཁོར་བ་ལས་ཀྱང་མི་སྐྱོད།
en: Mañjuśrī replied, “Venerable Mahākāśyapa, today we shall have our meal from a person who has been generous toward us.

source: མྱ་ངན་ལས་འདས་པ་ཡང་རྟོགས་པར་མི་བྱེད། སོ་སོའི་སྐྱེ་བོའི་ས་ལས་ཀྱང་མི་འདའ། འཕགས་པའི་ཆོས་མངོན་པར་ཡང་མི་བྱེད་པ་དེའི་ཟས་དེ་རིང་འཚལ་ལོ།
en: It is a person who does not move away from saṃsāra, who does not think of nirvāṇa, who does not pass beyond the level of an ordinary being, and who does not actualize the qualities of the noble ones.

source: །ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་གང་གིས་བདག་ཅག་ལ་སྦྱིན་པ་བྱིན་ནས་འབྲི་བར་ཡང་མི་འགྱུར་འཕེལ་བར་ཡང་མི་འགྱུར། ཆོས་གང་ཡང་སྐྱེད་པར་ཡང་མི་བགྱིད། འགག་པར་ཡང་མི་བགྱིད། ཆོས་གང་གཏོང་བར་ཡང་མི་བགྱིད། ཐོབ་པར་ཡང་མི་བགྱིད་པ་དེའི་ཟས་དེ་རིང་འཚལ་ལོ།
en: Venerable Mahākāśyapa, today we shall have our meal from a person for whom—after he has been generous toward us—no decrease or increase will come, nothing will be generated or stopped, and nothing will be given or gained.”

source: །གནས་བརྟན་གྱིས་སྨྲས་པ། འཇམ་དཔལ་དེ་ལྟར་སྦྱིན་པར་བགྱིད་པ་དེ་དང་དེ་དག་ནི་སྦྱིན་བདག་ཆེན་པོ་ལགས་ཀྱིས་མཆིའོ།། །།བམ་པོ་བཞི་པ།
en: The elder replied, “Mañjuśrī, such ways of generosity are practiced by great donors.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་སྙམ་དུ་གྱུར་ཏེ། བདག་ནི་སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་འགྲོའོ་སྙམ་མོ།
en: Then Mañjuśrī Kumārabhūta thought, “I will go to the city of Rājagṛha by means of the play of a buddha.”

source: །ཡང་དེའི་ཚེ་ན་ཏིང་ངེ་འཛིན་རྫུ་འཕྲུལ་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པ་ཞེས་བྱ་བ་ལ་མཉམ་པར་བཞག་གོ།
en: He then entered the absorption called manifesting all miracles.

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་རྫུ་འཕྲུལ་ཐམས་ཅད་རྣམ་པར་འཕྲུལ་པའི་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་མ་ཐག་ཏུ་དེ་ནས་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཐམས་ཅད་ལག་མཐིལ་བཞིན་དུ་མཉམ་པར་གྱུར་ཏོ།
en: As soon as Mañjuśrī Kumārabhūta rested in the absorption called manifesting all miracles, the entire Sahā world became even like the palm of a hand.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་སྣང་བ་ཆེན་པོས་སྣང་བར་གྱུར་ཏོ།
en: All the worlds in the great trichiliocosm were filled with bright light.

source: །སེམས་ཅན་དམྱལ་བ་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཡང་རྒྱུན་ཆད་དོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཡང་རྒྱུན་ཆད་དོ།
en: The suffering of beings in the hell realms ceased, as did the suffering of beings in the animal realms and in the realms of Yama.

source: །སེམས་ཅན་གང་ཡང་འདོད་ཆགས་སམ། ཞེ་སྡང་ངམ། གཏི་མུག་གམ། ང་འམ། གཡོའམ།
en: The attachment, aggression, dullness, fear, anxiety, anger, and sorrow of every being was eliminated.

source: ཁྲོ་བའམ། གནོང་འཆབ་པར་གྱུར་པ་མེད་དོ། །དེའི་ཚེ་སེམས་ཅན་ཐམས་ཅད་གཅིག་ལ་གཅིག་ཕ་དང་མར་འདུ་ཤེས་ཤིང་བྱམས་པ་ལ་གནས་པར་གྱུར་ཏོ།
en: At that moment, all beings regarded one another as parents and loved one another.

source: །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཡང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ།
en: All the worlds in the great trichiliocosm shook six times.

source: །འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་ཀྱང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་མཆོད་པར་བྱ་བའི་ལས་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: The gods in the realm of desire and the realm of form exerted themselves in venerating Mañjuśrī Kumārabhūta.

source: །སིལ་སྙན་བརྒྱ་སྟོང་ཡང་དཀྲོལ་བར་གྱུར་ཏོ། །མེ་ཏོག་དྲི་ཞིམ་པོའི་ཆར་ཀྱང་མངོན་པར་བབ་བོ། །ལམ་གྱི་བྱི་དོར་ཡང་བྱས་སོ།
en: Hundreds of thousands of instruments resounded, a rain of fragrant flowers fell, and paths were swept.

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་གཙུག་ལག་ཁང་དེའི་སྒོ་ནས་བཟུང་སྟེ། གྲོང་ཁྱེར་གྱི་སྒོའི་བར་དུ་དེའི་བར་གྱི་ལམ་ཐམས་ཅད་ལག་མཐིལ་བཞིན་དུ་མཉམ་པར་གྱུར་ཏོ།
en: As soon as Mañjuśrī Kumārabhūta entered that absorption, the entire road from the monastery gate to the city gate became even like the palm of one’s hand.

source: །རིན་པོ་ཆེ་དུ་མ་ནི་བསྩགས། རིན་པོ་ཆེ་དུ་མས་ནི་སྤྲས། རིན་པོ་ཆེའི་སྟེགས་བུས་ནི་བསྐོར།
en: The road was paved with many gems, numerous other jewels were strewn about, and jeweled railings were placed along both sides of the road.

source: ཞེང་དུ་ཤིང་རྟ་བདུན་ཙམ་དུ་མེ་ཏོག་པད་མ་དམར་པོ་དང་། ཀུ་མུ་ད་དང་། པུན་ད་རཱི་ཀས་ནི་གང་།
en: Pink, red, and white lotus flowers filled an area the width of seven chariots.

source: སྟེང་ནས་ནི་རིན་པོ་ཆེའི་དྲ་བས་གཡོགས། དར་གྱི་ལྡ་ལྡི་མང་པོ་ནི་བྲེས།
en: Above the road were nets of jewels, which were draped with many silken tassels.

source: གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། རུ་མཚོན་ནི་བསྒྲེང་བར་གྱུར་ཏོ།
en: Parasols, banners, standards, and pennants were erected.

source: །རིན་པོ་ཆེའི་སྟེགས་བུ་གཉིས་ཀྱི་གཡས་གཡོན་དུ་མདའ་རྒྱང་རེ་རེ་ཙམ་ན་རིན་པོ་ཆེའི་ཤིང་ཡོད་པར་གྱུར་ཏོ།
en: On both sides of the jeweled railings were jeweled trees up to the distance of an arrow shot.

source: །རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་ལས་རིན་པོ་ཆེའི་ཤིང་གཉིས་པ། རིན་པོ་ཆེའི་སྲད་བུས་སྦྲེལ་བར་གྱུར་ཏོ། །རིན་པོ་ཆེའི་ཤིང་རེ་རེ་ལས་ཀྱང་གང་དྲི་བྱུང་བར་གྱུར་པའི་དྲི་དེས་ནི་དཔག་ཚད་གཅིག་ཁོ་ར་ཁོར་ཡུག་ཏུ་ཁྱབ་པར་གྱུར་ཏོ།
en: All the jeweled trees were connected with jeweled cords, and from each jeweled tree wafted a fragrance that filled the atmosphere for up to a league.

source: །རིན་པོ་ཆེའི་ཤིང་གཉིས་ཀྱི་བར་ན་རྫིང་བུ་སྤྲུལ་པར་གྱུར་ཏེ། གསེར་གྱི་བྱེ་མ་ནི་བཀྲམ། རིན་པོ་ཆེའི་སྟེགས་བུས་ནི་བསྐོར། ནོར་བུ་བཻ་དཱུརྱའི་སྐས་ནི་ཟུག །མེ་ཏོག་ཨུད་པ་ལ་དང་།
en: Between every pair of jeweled trees emanated small ponds underlain by golden sand, surrounded by jewel ledges, and entered via stairs made of beryl gems.

source: པད་མ་དང་། ཀུ་མུ་ད་དང་། པུན་ད་རཱི་ཀས་ནི་བཀབ། བྱ་ངུར་པ་ནི་སྐད་འབྱིན།
en: The ponds were covered with blue, pink, red, and white lotuses, and the calls of ducks rang out.

source: ཆུ་ཡན་ལག་བརྒྱད་དང་ལྡན་པས་ནི་ཡོངས་སུ་གང་བར་གྱུར་ཏོ།
en: The ponds were filled water of eight qualities.

source: །ཤིང་ཐམས་ཅད་ལ་རིན་པོ་ཆེ་དང་གསེར་གྱི་དྲ་བ་ནི་བྲེས་པར་གྱུར་ཏོ།
en: Each tree was draped with nets of jewels and gold.

source: །རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་ཀྱི་བར་ན་རིན་པོ་ཆེའི་པོག་ཕོར་ནས་སྤོས་ཀྱིས་ནི་བདུགས་པར་གྱུར་ཏོ། །རིན་པོ་ཆེའི་ཤིང་ཐམས་ཅད་ཀྱི་དྲུང་ན་ལྷའི་བུ་མོ་ཉི་ཤུ་རྩ་ལྔ་ལྔ་སྤྲུལ་ཡོད་པ་ནས་བྱུང་བའི་ཙན་དན་གྱི་སྙིང་པོའི་ཕྱེ་མ་ཐོགས་ཏེ་འདུག་པར་གྱུར་ཏོ།
en: Between the jeweled trees were jeweled incense bowls wafting incense, and before each jeweled tree manifested twenty-five goddesses bearing sandalwood powder.

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཏིང་ངེ་འཛིན་དེ་ལ་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་ངོ་མཚར་དང་རྨད་དུ་བྱུང་བ་འདི་དག་དང་གཞན་དག་ཀྱང་སྣང་ངོ་།
en: As soon as Mañjuśrī Kumārabhūta entered this absorption, these and other wonders and marvels occurred.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཤམ་ཐབས་བགོས་ཏེ། གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ཁྱོད་ནི་མདུན་དུ་བཞུད་ཅིག །
en: Mañjuśrī Kumārabhūta then donned his lower garment and said to the elder Mahākāśyapa, “Venerable Mahākāśyapa, please go first.

source: བདག་ནི་ཁྱོད་ཀྱི་སླད་བཞིན་དུ་མཆིའོ།
en: I will follow you.

source: གནས་བརྟན་འོད་སྲུང་ཆེན་པོ་ནི་བགྲེས་ལ་རབ་ཏུ་བྱུང་ནས་ཀྱང་ཡུན་རིང་སྟེ།
en: Elder Mahākāśyapa, you are senior, and more time has passed since you were ordained.

source: དེ་བཞིན་གཤེགས་པ་མ་མཐོང་བར་རབ་ཏུ་བྱུང་ཞིང་། གང་འཇིག་རྟེན་ན་དགྲ་བཅོམ་པ་དེའི་རྗེས་སུ་རབ་ཏུ་བྱུང་བས་དེ་བས་ན།
en: You took ordination without having seen the Thus-Gone One—instead you took ordination with those who are worthy ones in the world.

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ཁྱོད་ནི་མདུན་དུ་བཞུད་ཅིག །
en: Thus, Venerable Mahākāśyapa, please go first.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། འོད་སྲུང་ཆེན་པོས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཇམ་དཔལ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལས་ནི་སུ་ཡང་ནས་རྒན་པ་དང་། ལོ་གྲངས་ཀྱིས་རྒན་པ་ཞེས་མི་བགྱིའི།
en: Mahākāśyapa said to Mañjuśrī Kumārabhūta, “Mañjuśrī, in the well-spoken Dharma-Vinaya, no one is considered senior because of their age.

source: འཇམ་དཔལ་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལས་ནི། ཤེས་རབ་ཀྱིས་རྒན་པ་དང་། ཐོས་པས་རྒན་པ་དང་། སྤོབས་པས་རྒན་པ་དང་།
en: Mañjuśrī, in the well-spoken Dharma-Vinaya, one is considered senior because of one’s knowledge, study, eloquence, and discerning faculties.

source: དབང་པོ་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་ལ་རྒན་པ་ཞེས་བགྱི་ལ། འཇམ་དཔལ་ཁྱོད་ཀྱང་ཤེས་རབ་ཀྱིས་བགྲེས། གསན་པས་བགྲེས། སྤོབས་པས་བགྲེས།
en: Mañjuśrī, you are senior in knowledge, study, and eloquence.

source: དབང་པོ་དམ་པ་དང་།
en: You are also more knowledgeable with regard to knowing both sublime and ordinary faculties.

source: དམ་པ་མ་ལགས་པར་མཁྱེན་པ་ལ་མཁས་པས་དེའི་སླད་དུ་ཁྱོད་ཉིད་ཐུ་བོ་བགྲེས་པ་ལགས་ཀྱིས་མདུན་དུ་བཞུད་ཅིག །
en: Therefore, you are the most senior.

source: །ཡང་འཇམ་དཔལ་དོན་འདི་ཉིད་ཤིན་ཏུ་བཤད་པའི་སླད་དུ་སྐབས་འདིར་བདག་གིས་དཔེ་ཙམ་ཞིག་བཤད་པར་སྤོབས་སོ། །འཇམ་དཔལ་འདི་ལྟ་སྟེ།
en: Mañjuśrī, in order to clearly explain this point, I would like to mention an analogy here.

source: དཔེར་ན་སེང་གེའི་ཕྲུ་གུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པ་ནི་བདག་གི་སྟོབས་ཀྱི་ཤུགས་མ་རྫོགས་མོད་ཀྱི།
en: Mañjuśrī, to draw an analogy, it is only long after a lion cub is born that it reaches its full strength.

source: སེང་གེའི་ཕྲུ་གུ་དེའི་དྲི་རླུང་གིས་གང་དང་གང་དུ་ཁྱེར་བ་དེ་དང་དེ་དག་ཏུ་རི་དགས་ཐམས་ཅད་དྲི་དེ་མི་བཟོད་ནས་འབྲོས་པར་བགྱིད་དེ།
en: Nevertheless, wherever the wind carries the scent of the lion cub, all wild animals will be unable to bear it and will flee.

source: བལ་གླང་གླང་པོ་ཆེན་པོ་ལོ་དྲུག་ཅུ་ལོན་པ། ལིག་རི་སྲ་བས་དམ་དུ་བཅིངས་པ་དེ་དག་ཀྱང་སེང་གེའི་ཕྲུ་གུ་དེའི་དྲིས་ཕོག་པ་དང་། འཇིགས་སྐྲག་ནས་ལིག་རིས་བཅིངས་པ་དེ་དག་བཅད་དེ་ཕྱོགས་ཕྱོགས་སུ་འབྲོས་སོ། །ཕུག་ན་གནས་པ་ནི་ཕུག་ཏུ།
en: Even a sixty-year-old elephant tightly bound with chains will become so terrified when it encounters the scent of the lion cub that it will break its chains and flee in any direction.

source: ཁུང་ན་གནས་པ་ནི་ཁུང་དུ་འཇུག །ཆུ་ན་གནས་པ་ནི་ཆུར་འཇུག །བྱ་ནི་ནམ་མཁའ་ལ་འཕུར་རོ། །འཇམ་དཔལ་དེ་བཞིན་དུ།
en: Other animals that live in caves will take shelter in their caves, those that live in burrows will take shelter in their burrows, those that live in bodies of water will take shelter in the water, and birds will fly into the sky.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཐོག་མ་བསྐྱེད་པ་ཡང་ཤེས་རབ་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་བསྐྱེད་པ་མ་ཐོབ་མོད་ཀྱི། སེམས་བསྐྱེད་མ་ཐག་ཏུ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པར་འགྱུར།
en: Likewise, Mañjuśrī, even though bodhisattvas who have initially developed the mind directed toward awakening may not have fully developed the strength of their insight and wisdom, they will outshine all hearers and solitary buddhas as soon as they have developed the mind directed toward awakening.

source: བདུད་ཐམས་ཅད་ཀྱང་འཇིགས་པར་འགྱུར་ཞིང་སྐྲག་ནས།
en: They will scare and frighten all the māras.

source: བདག་གི་ཁང་པ་ན་མི་དགའ་བར་འགྱུར་རོ།
en: They will no longer prefer the domestic life. “

source: །ཡང་འཇམ་དཔལ་སེང་གེའི་ཕྲུ་གུ་དེས་སེང་གེའི་སྟོབས་དང་། ཤུགས་ཐོབ་པ་གཞན་དག་སེང་གེའི་སྐད་འབྱིན་པའི་སྒྲ་ཐོས་ན་ཡང་འཇིགས་དངངས་སྐྲག་པར་མི་འགྱུར་གྱི། སྟེང་དུ་བདག་ཀྱང་རིང་པོ་མི་ཐོགས་པར་སེང་གེའི་སྐད་འབྱིན་ཏོ་སྙམ་དུ་སེམས་པར་འགྱུར་རོ། །འཇམ་དཔལ་དེ་བཞིན་དུ།
en: Furthermore, Mañjuśrī when that lion cub hears the roar of other lions that have already gained their power and strength, it will not be scared or frightened, since it understands that before long it, too, will be able to roar.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་། སངས་རྒྱས་ཀྱི་སེང་གེའི་སྐད་ཐོས་ནས། མི་འཇིགས། མི་དངངས། སྐྲག་པར་མི་འགྱུར་གྱི། སྟེང་དུ་བདག་ཀྱང་རིང་པོ་མི་ཐོགས་པར་དེ་བཞིན་དུ་བྱང་ཆུབ་ཐོབ་ནས། དེ་དང་འདྲ་བར་སེང་གེའི་སྐད་ཡང་དག་པར་འབྱིན་པར་བྱའོ་སྙམ་དུ་སེམས་པར་འགྱུར་རོ།
en: Likewise, Mañjuśrī, bodhisattva great beings who hear the lion’s roar of the Buddha are not scared, frightened, or terrified, for they understand that soon they, too, will attain awakening and make a lion’s roar in the same way. “

source: །འཇམ་དཔལ་དེ་ལྟ་བས་ན། གང་དག་ཉན་ཐོས་ཀྱི་ནང་ན་གང་བགྲེས། རང་སངས་རྒྱས་ཀྱི་ནང་ན་གང་བགྲེས། དེ་བཞིན་གཤེགས་པའི་ནང་ན་གང་བགྲེས་ཞེས་སྨྲ་ཞིང་། ཡང་དག་པར་རྗོད་པ་དེ་དག་ནི་འཇམ་དཔལ་བྱང་ཆུབ་ཀྱི་སེམས་ལ་སྨྲ་ཞིང་།
en: Therefore, Mañjuśrī, speaking of the seniority among the hearers, the seniority among the solitary buddhas, and the seniority among the thus-gone ones is to address and speak of the mind of awakening.

source: ཡང་དག་པར་རྗོད་པ་ལགས་སོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is this?

source: འཇམ་དཔལ་དགེ་བའི་ཆོས་དེ་དག་ཐམས་ཅད་ནི་དེ་ལས་བྱུང་ངོ་།
en: Mañjuśrī, all their virtuous qualities come from the mind of awakening.

source: །དེའི་སླད་དུ་ཡང་འཇམ་དཔལ་ཁྱོད་ནི་ཐུ་བོ་བགྲེས་པོ་ལགས་ཀྱིས་སྔོན་དུ་བཞུད་ཅིག །
en: For this reason, Mañjuśrī, you are the most senior. Therefore, please go first.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་མདུན་དུ་སོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཀྱང་། དེའི་ཕྱི་བཞིན་དུ་དོང་ངོ་།
en: Accordingly, Mañjuśrī Kumārabhūta went first while the bodhisattva great beings and the great hearers followed him.

source: །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་རིན་པོ་ཆེའི་ལམ་དེར་སོང་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་སྟེང་གི་བར་སྣང་ལས། མེ་ཏོག་གི་ཆར་ཆེན་པོ་ཡང་མངོན་པར་བབ་བོ། །སིལ་སྙན་བརྒྱ་སྟོང་གི་སྒྲ་ཡང་བྱུང་ངོ་། །ས་ཆེན་པོ་ཡང་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ། །འཇིག་རྟེན་ཡང་སྣང་བ་ཆེན་པོས་ཁྱབ་པར་གྱུར་ཏོ།
en: As soon as Mañjuśrī Kumārabhūta set out upon the jeweled road, a rain of flowers fell from the sky above, the sounds of hundreds of thousands of instruments were heard, the great earth trembled six times, and the world was bathed in a bright light.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དེ་འདྲ་བའི་བཀོད་པ་དང་ལྡན་ནས། ལུས་ལས་འོད་ཟེར་བརྒྱ་སྟོང་ནི་བྱུང་། མེ་ཏོག་པད་མའི་ཆར་ནི་འབབ་བཞིན་དུ། གྲོང་ཁྱེར་ཆེན་པོར་སོང་བ་དང་།
en: Then, within this setting, and as a shower of lotus flowers fell, Mañjuśrī Kumārabhūta went to the city with hundreds of thousands of light rays streaming from his body.

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་ཉིས་སྟོང་དང་། ཉན་ཐོས་ལྔ་བརྒྱ་ཙམ་གྱིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་འོང་ངོ་ཞེས་ཐོས་ནས་འདི་སྙམ་དུ་གྱུར་ཏེ། འདིར་ནི་ལྔ་བརྒྱའི་བཤོས་སྦྱར་ལ་ད་འདི་སྙེད་ཀྱི་མང་པོ་ཞིག་གཤེགས་པར་གྱུར་ན་གང་དུ་བཞུགས་ཅི་གསོལ་སྙམ་སྟེ།
en: Hearing that Mañjuśrī Kumārabhūta was arriving accompanied and venerated by eighty-two thousand bodhisattvas and five hundred hearers, King Ajātaśatru thought, “We have only prepared the meal for five hundred people, yet now so many people are coming. Where will they stay?

source: དེ་ལྟར་བདག་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བསླུས་སོ་སྙམ་དུ།
en: I have been deceived by Mañjuśrī Kumārabhūta.”

source: རྒྱལ་པོ་མ་སྐྱེས་དགྲ་དེ་ལྟར་སེམས་སྐྱེས་མ་ཐག་ཏུ་དེ་ནས་དེའི་མོད་ལ་རྒྱལ་པོ་ཆེན་པོ་ངལ་བསོ་པོ་དང་། གནོད་སྦྱིན་གྱི་བདག་པོ་ཀུ་བེ་རས། བདག་ཅག་གི་ལུས་ཆེ་བ་བསྟན་ནས། རྒྱལ་པོ་མ་སྐྱེས་དགྲ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རྒྱལ་པོ་ཆེན་པོ་མི་དགར་མ་བྱེད་ཅིག །
en: As soon as King Ajātaśatru had this thought, the great king Vaiśravaṇa and the yakṣa lord Kubera revealed their magnificent forms and said to King Ajātaśatru, “Great King, do not be displeased.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་ཤེས་རབ་ཆེ་བ།
en: Mañjuśrī Kumārabhūta is superior in insight.

source: ཤེས་རབ་ཀྱི་གཟི་བརྗིད་དང་ལྡན་པ།
en: His insight is resplendent.

source: རྫུ་འཕྲུལ་གྱི་བྱིན་གྱིས་རློབ་པ་ལ་མཁས་པ་ཡིན་ཏེ།
en: He is skilled in the art of miraculous consecration.

source: དེ་ནི་འདོད་ན་ཟན་ཆང་གཅིག་གིས་ཀྱང་།
en: If he wishes, he can feed all beings in the great trichiliocosm with a single serving of food and drink.

source: སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་འགྲངས་པར་བྱེད་མཁས་ན་བརྒྱད་ཁྲི་ཉིས་སྟོང་ལ་ལྟ་ཅི་སྨོས་ཏེ།
en: So what need we say of eighty-two thousand people?

source: རྒྱལ་པོ་ཆེན་པོ་མི་དགར་མ་བྱེད་ཅིག །
en: Great King, do not be displeased.

source: ཐམས་ཅད་ལ་ཁྱེད་པར་འོང་ངོ་།
en: There will be enough for everyone.

source: རྒྱལ་པོ་ཆེན་པོ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་སྦྱིན་པའི་ཐབས་ནི་ཟད་མི་ཤེས་སོ།
en: Great King, Mañjuśrī Kumārabhūta’s skill in giving is limitless.”

source: །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་ཚིག་དེ་ཐོས་པ་དང་།
en: When King Ajātaśatru heard this, he became happy and delighted.

source: དགའ་མགུ་རངས་རབ་ཏུ་དགའ་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ནས་ཡང་ཤིན་ཏུ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་སྟོན་པའི་འདུ་ཤེས་ཀྱིས་བཀུར་སྟི་བྱེད་པར་གྱུར་ཏོ། །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་བདག་གི་འགྲོ་བ་དང་འཁོར་དང་བཅས་ཏེ།
en: Filled with joy, happiness, and delight, he venerated Mañjuśrī Kumārabhūta as a teacher.

source: མེ་ཏོག་དང་། དྲི་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་ཐོགས་ནས་གཡོག་དང་བཅས་པས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་བསུ་བའི་ཕྱིར་ཕྱི་རོལ་དུ་བྱུང་ནས།
en: King Ajātaśatru, along with his people, his retinue, and his servants, then went outside to greet Mañjuśrī Kumārabhūta bearing flowers, incense, garlands, ointments, and fragrant powders.

source: དེས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་མཆོད་པ་བྱས་ཏེ། སླར་བདག་གི་ཁྱིམ་དུ་སོང་ངོ་།
en: They offered these things to Mañjuśrī Kumārabhūta and returned to the palace.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འཁོར་དང་བཅས་ཏེ། རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁང་པ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་ནང་དུ་དོང་ངོ་།
en: Mañjuśrī Kumārabhūta and his assembly also proceeded to King Ajātaśatru’s home and went inside.

source: །ནང་དུ་ཕྱིན་པ་དང་། གྲོང་ཁྱེར་ན་གནས་པ་ཐམས་ཅད་ཀྱང་མཆོད་པའི་ལས་ལ་བརྩོན་པར་གྱུར་ཏོ།
en: Everyone in the city, whether they had gone inside the palace or remained outside, exerted themselves in worship.

source: །ཡང་དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་གཟིགས་པ་ཞེས་བྱ་བ་ཞིག་འདུས་པར་གྱུར་ཏོ།
en: Among the assembly of bodhisattvas at that time was a bodhisattva great being named Samantadarśin.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་གཟིགས་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འཁོར་གྱི་གནས་བཀོད་པ་བྱའོ།
en: Mañjuśrī Kumārabhūta addressed this bodhisattva great being Samantadarśin, “Noble son, please arrange a place for the assembly to sit.

source: །དེའི་དུས་ལ་བབ་པར་ཤེས་པར་གྱིས་ཤིག །
en: Know that the time has come.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་གཟིགས་པས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁབ་ཀྱི་གཡས་གཡོན་དུ་བལྟས་པ་དང་། བལྟས་མ་ཐག་ཏུ་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་ཁབ་ཏུ་འཁོར་གྱི་གནས་བྱུང་སྟེ།
en: The bodhisattva great being Samantadarśin looked to the right and left of King Ajātaśatru’s palace, and within King Ajātaśatru’s palace there immediately appeared a place where the assembly could sit.

source: དར་གྱི་ལྡ་ལྡི་མང་པོ་ནི་བཏགས།
en: The place was adorned with many silken streamers and draped with canopies.

source: བླ་རེ་ནི་བྲེས། གདུགས་དང་། རྒྱལ་མཚན་དང་བ་དན་ནི་བསྒྲེང་།
en: Parasols, banners, and standards were raised.

source: མེ་ཏོག་སིལ་མས་ནི་བཀང་ཞིང་ལག་མཐིལ་བཞིན་དུ་མཉམ་པ་དང་། ཡངས་ཤིང་རྒྱ་ཆེ་བར་གྱུར་ཏོ།
en: It was filled with flower petals that were even like the palm of one’s hand, and it was vast and extensive.

source: །ཡང་དེའི་ཚེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ལས་མངོན་པར་འཕགས་པ་ཞེས་བྱ་བ་ཞིག །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་དེར་འདུས་པར་གྱུར་ཏོ།
en: At that time there was also a bodhisattva great being named Elevated by the Dharma among the bodhisattva assembly.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལས་མངོན་པར་འཕགས་པ་བོས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་སྟན་གདིང་བར་གྱིས་ཤིག །
en: Mañjuśrī Kumārabhūta called out to this bodhisattva Elevated by the Dharma, “Noble son, please lay out seats.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ལས་མངོན་པར་འཕགས་པས་དེའི་ཚེ་སེ་གོལ་གྱི་སྒྲ་བྱས་པ་དང་།
en: Then, with a snap of his fingers, the bodhisattva Elevated by the Dharma caused forty-two thousand seats to appear within the assembly place.

source: དེ་ནས་དེའི་ཚེ་འཁོར་གྱི་གནས་དེ་ནས་སྟན་རྣམ་པ་སྣ་ཚོགས་པ་བལྟ་ན་སྡུག་པ། གོས་དུ་མས་གཡོགས་པ་བཞི་ཁྲི་ཉིས་སྟོང་མངོན་པར་བྱུང་བར་གྱུར་ཏོ།
en: The seats were beautiful and covered with myriad fabrics.

source: །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་བཏིང་བ་དེ་ལ་འདུག་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་དང་། ཉན་ཐོས་ཆེན་པོ་དེ་དག་ཀྱང་སྟན་དེ་དག་ལ་ཅི་རིགས་པར་འཁོད་དོ།
en: Mañjuśrī Kumārabhūta then sat down on a seat that had been laid out for him, and the bodhisattva great beings and great hearers likewise sat down on their respective seats.

source: །དེ་ནས་རྒྱལ་པོ་མ་སྐྱེས་དགྲས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལ་འདུག་པར་ཤེས་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །འཇམ་དཔལ་འབྲས་ཆན་སླད་མ་གྲོལ་གྱི་བར་དུ་ཅུང་ཟད་ཅིག་གཞེས་ཤིག །འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Seeing that Mañjuśrī Kumārabhūta was seated, King Ajātaśatru said, “Mañjuśrī, please wait a little until the food has been prepared.”

source: རྒྱལ་པོ་ཆེན་པོ་ཐམས་ཅད་ལ་ཆོག་པར་འགྱུར་གྱིས་བྱ་བ་ཉུང་ངུ་གྱིས་ཤིག །
en: Mañjuśrī replied, “Great King, there will be enough for everyone, so there is no need to prepare much.”
